remoting/soap/in.xml

<?xml version="1.0" encoding="utf-8"?><soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"  xmlns:tns="http://soap.advsd.nccu/"><soap:Body><tns:add><x>6</x><y>6</y></tns:add></soap:Body></soap:Envelope>